app/controllers/api/dislikes_controller.rb

INSERT INTO "dislikes" ("profile_id", "program_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["profile_id", 1], ["program_id", 47], ["created_at", "2020-02-21 03:15:25.973710"], ["updated_at", "2020-02-21 03:15:25.973710"]]
---
    def create
        @dislike = Dislike.new(program_id: params[:program_id], profile_id: current_profile.id)
        @dislike.profile_id = current_profile.id

        if !Like.exists?(program_id: @dislike.program_id, profile_id: current_profile.id) && @dislike.save!