app/controllers/api/genres_controller.rb

  def index
    @genres = Genre.includes(:likes, :dislikes, :watches).all
---
SELECT "genres".* FROM "genres" WHERE "genres"."id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11)  [["id", 2], ["id", 4], ["id", 9], ["id", 11], ["id", 3], ["id", 8], ["id", 7], ["id", 6], ["id", 10], ["id", 5], ["id", 1]]