app/controllers/api/profiles_controller.rb

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."profile_id" = $1  [["profile_id", 1]]
---
    def show
        @profile = Profile.includes(:likes).find(params[:id])