app/controllers/api/programs_controller.rb

SELECT "genres".* FROM "genres" WHERE "genres"."id" IN ($1, $2, $3, $4, $5, $6)  [["id", 9], ["id", 2], ["id", 3], ["id", 10], ["id", 8], ["id", 4]]
SELECT "programs".* FROM "programs" WHERE "programs"."id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35, $36, $37, $38, $39, $40, $41, $42, $43, $44, $45, $46, $47, $48, $49, $50, $51)
SELECT "programs".* FROM "programs" WHERE "programs"."program_type" = $1  [["program_type", "Movie"]]
SELECT "genres".* FROM "genres"
SELECT "programs".* FROM "programs" INNER JOIN "watchlists" ON "programs"."id" = "watchlists"."program_id" WHERE "watchlists"."profile_id" = $1  [["profile_id", 1]]
---
  def index
    if params[:genre_ids]
      @programs = []
      Genre.includes(:programs).find(params[:genre_ids]).each {|genre| @programs.push(*genre.programs)}
      @programs = (@programs + current_profile.watched_programs).uniq
    elsif params[:type]
      @programs = Program.with_attached_logo.where(program_type: params[:type])

    else
      @programs = Program.with_attached_logo.all.includes(:genres)
    end

    if (@programs.length == 0)

SELECT  "programs".* FROM "programs" WHERE "programs"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
---
  def show

    @program = Program.find(params[:id])

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "genres".* FROM "genres" WHERE "genres"."id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13)  [["id", 8], ["id", 2], ["id", 5], ["id", 9], ["id", 3], ["id", 1], ["id", 10], ["id", 4], ["id", 12], ["id", 11], ["id", 15], ["id", 13], ["id", 14]]
SELECT "programs".* FROM "programs" INNER JOIN "watchlists" ON "programs"."id" = "watchlists"."program_id" WHERE "watchlists"."profile_id" = $1  [["profile_id", 1]]
---
  def watchlist
    @programs = Profile.find(params[:profile_id]).watched_programs.includes(:genres)

      if (@programs.length == 0)