app/controllers/api/sessions_controller.rb

    def create
        #will have to get watchlists through profiles

        @user = User.includes(:watchlists, :profiles).find_by_cred(params[:user][:email], params[:user][:password])
        if @user
            login(@user)
            render "api/users/show"
        else
            if (User.find_by(email: params[:user][:email]))
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "demo@demo.com"], ["LIMIT", 1]]