app/views/api/profiles/show.json.jbuilder

SELECT "watchlists".* FROM "watchlists" WHERE "watchlists"."profile_id" = $1  [["profile_id", 1]]
---
json.watchlist do
  @profile.watchlists.each do |watch|