app/views/api/genres/index.json.jbuilder

SELECT COUNT(*) FROM "dislikes" INNER JOIN "programs" ON "dislikes"."program_id" = "programs"."id" INNER JOIN "genre_links" ON "programs"."id" = "genre_links"."program_id" WHERE "genre_links"."genre_id" = $1 AND "dislikes"."profile_id" = $2  [["genre_id", 1], ["profile_id", 1]]
SELECT COUNT(*) FROM "likes" INNER JOIN "programs" ON "likes"."program_id" = "programs"."id" INNER JOIN "genre_links" ON "programs"."id" = "genre_links"."program_id" WHERE "genre_links"."genre_id" = $1 AND "likes"."profile_id" = $2  [["genre_id", 1], ["profile_id", 1]]
---
      json.id genre.id
      json.viewer_points genre.viewer_points(genre.likes.where(profile_id: current_profile.id).count,
                                              genre.dislikes.where(profile_id: current_profile.id).count,
                                              genre.watches.where(profile_id: current_profile.id).count)