animetflix/app/models/movie.rb

SELECT "genres".* FROM "genres" INNER JOIN "genre_links" ON "genres"."id" = "genre_links"."genre_id" WHERE "genre_links"."movie_id" = $1  [["movie_id", 2]]
---
  def list_genres
    self.genres.map {|genre| genre.name}