animetflix/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "demo@demo.com"], ["LIMIT", 1]]
---
    def self.find_by_cred(email, pw)
        user = User.find_by(email: email);

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "GSf0bBpQFW25q8pcvWh0Dg"], ["updated_at", "2019-12-11 01:38:37.698864"], ["id", 1]]
---
    def reset_token!
        self.session_token = SecureRandom.urlsafe_base64(16)
        self.save!