animetflix/app/controllers/api/movies_controller.rb

SELECT "genres".* FROM "genres" WHERE "genres"."id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11)  [["id", 2], ["id", 4], ["id", 9], ["id", 11], ["id", 3], ["id", 8], ["id", 7], ["id", 6], ["id", 10], ["id", 5], ["id", 1]]
SELECT "movies"."id" FROM "movies" INNER JOIN "genre_links" ON "movies"."id" = "genre_links"."movie_id" WHERE "genre_links"."genre_id" = $1  [["genre_id", 1]]
SELECT "genres".* FROM "genres"
SELECT "movies".* FROM "movies"
---
  def index
    if params[:genre_id]
      @movies = Genre.find(params[:genre_id]).movies.includes(:genres)
    # elsif params[:watchlist_id]
    else
      @movies = Movie.all.includes(:genres)