animetflix/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "DX4gEBMrqB1wj1zSO6m6dA"], ["LIMIT", 1]]
---
    def current_user
        return unless session[:session_token]
        User.find_by(session_token: session[:session_token])