app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "lgcuoxUXU1QoBy9zk1Wwgg"], ["LIMIT", 1]]
---
    def current_user
        return unless session[:session_token]
        User.includes(:profiles).find_by(session_token: session[:session_token])

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "watchlists".* FROM "watchlists" WHERE "watchlists"."profile_id" = $1  [["profile_id", 1]]
---
    def current_profile
        return unless session[:profile_id]
        Profile.includes(:watchlists).find_by(id: session[:profile_id])