app/models/user.rb

    def self.find_by_cred(email, pw)
        user = User.find_by(email: email);
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "demo@demo.com"], ["LIMIT", 1]]

    def reset_token!
        self.session_token = SecureRandom.urlsafe_base64(16)
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "WKgzHEqtSYrhk1V7IO2pWQ"], ["updated_at", "2020-02-21 03:27:24.638470"], ["id", 1]]