app/controllers/concerns/programs_controller_filter.rb

  def search_filter_list(query)
    list = Program.all_filter(query).limit(18).includes(:genres)
    if (list.length < 24)
      remain = 24 - list.length
      list = (list + Program.all_include_filter(query).includes(:genres)).uniq.take(24)
---
SELECT "genres".* FROM "genres" WHERE "genres"."id" IN ($1, $2, $3, $4)  [["id", 9], ["id", 10], ["id", 4], ["id", 2]]