animetflix/app/views/api/movies/_movie.json.jbuilder

SELECT "genres".* FROM "genres" INNER JOIN "genre_links" ON "genres"."id" = "genre_links"."genre_id" WHERE "genre_links"."movie_id" = $1  [["movie_id", 2]]
---
else
  json.genres movie.list_genres.take(3)